sanshiki/deskGPT/stm32/deskGPT/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define VS10XX_DQ_Pin GPIO_PIN_6
#define VS10XX_DQ_GPIO_Port GPIOF
#define VS10XX_RST_Pin GPIO_PIN_0
#define VS10XX_RST_GPIO_Port GPIOC
#define I2S2_SD_Pin GPIO_PIN_3
#define I2S2_SD_GPIO_Port GPIOC
#define SPI1_SCK_Pin GPIO_PIN_5
#define SPI1_SCK_GPIO_Port GPIOA
#define SPI1_SO_Pin GPIO_PIN_6
#define SPI1_SO_GPIO_Port GPIOA
#define SPI1_SI_Pin GPIO_PIN_7
#define SPI1_SI_GPIO_Port GPIOA
#define VS10XX_XCS_Pin GPIO_PIN_10
#define VS10XX_XCS_GPIO_Port GPIOB
#define VS10XX_XDCS_Pin GPIO_PIN_11
#define VS10XX_XDCS_GPIO_Port GPIOB
#define I2S2_WS_Pin GPIO_PIN_12
#define I2S2_WS_GPIO_Port GPIOB
#define I2S2_CK_Pin GPIO_PIN_13
#define I2S2_CK_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
